#+DATE: <2017-01-03 Tue>
#+POSTID: 60
# # -*- org-odt-styles-file: "/home/matt/.emacs.d/Templates/RLG231Syllabus.odt"; -*-
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
# #+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil prop:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:2 todo:t |:t
#+STARTUP: customtime entitiespretty
#+TITLE: Digital History: His389, Winter 2017
#+AUTHOR: Matt Price
#+EMAIL: matt.price@utoronto.ca

#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+ODT_STYLES_FILE: "/home/matt/.emacs.d/Templates/New113Syllabus.odt"
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1 (Org mode 9.0.1)
# #+SETUPFILE: /home/matt/src/org-html-themes/setup/theme-bigblow.setup

* Course Requirements & Grading
:PROPERTIES:
:ID:       o2b:8cabb212-5b29-445e-9c1a-d108bdfff9c4
:POST_DATE: [2017-01-06 Fri 12:49]
:POSTID:   601
:BLOG:     dig
:END:
The assignments in this course take a wide variety of forms, and for the most part, differ significantly from what you're likely to have encountered in other History courses. If you have little technical experience, or have perhaps ended up in this course by accident (!), you may find some of the work daunting at first. I have done my very best to make the assignments feasible for beginners, but you will likely encounter some difficult moments.  I therefore *strongly* urge you to (1) start early! and (2) persevere through the difficult initial stages.  The frustration you experience is, in fact, part of pedagogical method here.  You are not expected to become a coding ninja, but /learning how to learn/ is a major component of work in the Digital Humanities.  

I know there will be questions!  Please don't hesitate to ask them.  And here, finally, is the list of assignments. Detailed assignments will be provided with adequate time to permit completion.
| <25>                      | <35>                                | <9>       |                                 <36> |
| Assignment                | Brief Description                   | Due Date  |                           Percentage |
|---------------------------+-------------------------------------+-----------+--------------------------------------|
| HTML & CSS self-study     | Pass/Fail: self-guided learning on codacademy.com | <2017-01-20 Fri> |                                   10 |
| Javascript for DH         | Pass/Fail: problem set              | <2017-02-03 Fri> |                                   15 |
| Spatial History           | Simple GIS Web project              | <2017-03-03 Fri> |                                   20 |
| Oral History              | Multimedia Web Project              | <2017-03-24 Fri> |                                   25 |
| Project Proposal          | Imagine a Digital History Project   | <2017-04-05 Wed> |                                   30 |
|---------------------------+-------------------------------------+-----------+--------------------------------------|
| Total                     |                                     |           |                                  100 |
#+TBLFM: @8$4=vsum(@I..@II)

